app/views/users/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
                                                    <%if user_signed_in?%>
                                                        <% pre_follow = @company_by_employer.company_follows.find { |follow| follow.user_id == current_user.id} %>