app/views/pages/index.html.erb

                                <%if user_signed_in?%>
                                    <% pre_follow = company.company_follows.find { |follow| follow.user_id == current_user.id} %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]