app/helpers/session_helper.rb

    def current_user
        @current_user ||= User.find_by id: session[:user_id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]