app/views/posts/index.html.erb

                                        <div class="post_comment">
                                            <a><i class="material-icons-outlined">chat_bubble_outline</i><span><%=post.post_comments.count%></span></a>
---
SELECT "posts".* FROM "posts"