app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_param)

        @post.username = @current_user.name

        if @post.save
---
INSERT INTO "posts" ("username", "content", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "a"], ["content", "sadas"], ["title", "sadas"], ["created_at", "2020-04-04 11:38:01.814488"], ["updated_at", "2020-04-04 11:38:01.814488"]]

    def current_user
        @current_user ||= User.find_by id: session[:user_id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def show
        @post = Post.find params[:id]
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]

    def edit
        @post = Post.find params[:id]
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

    def update
        @post = Post.find params[:id]
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

    def destroy
        @post = Post.find params[:id]
        @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 10]]