app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        user_present = User.friendly.find_by(email: user_params[:email].downcase)

        if user_present.present?
            flash[:danger] = "Email đã được đăng kí, vui lòng thử đăng nhập lại hoặc thay đổi mật khẩu... "
            redirect_to login_path
        else
            if @user.password == @user.password_confirmation
                # special admin config

                if @user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "asda"], ["password_digest", "$2a$12$740AJ7W1vXZKgg9cfVAyu.pLUIN7FkaTFee7UnB.9/XZGBDz5Gh8i"], ["created_at", "2020-04-02 16:40:50.103252"], ["updated_at", "2020-04-02 16:40:50.103252"]]

    def show
        @user = User.friendly.find_by id: params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]